MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1579/mcu.h
extern volatile PWM1OFCONbits_t PWM1OFCONbits __at(0xDA0);
// bitfield macros
#define _PWM1OFCON_OFS_POSN                                 0x0
#define _PWM1OFCON_OFS_POSITION                             0x0
#define _PWM1OFCON_OFS_SIZE                                 0x2
#define _PWM1OFCON_OFS_LENGTH                               0x2
#define _PWM1OFCON_OFS_MASK                                 0x3
#define _PWM1OFCON_OFO_POSN                                 0x4
#define _PWM1OFCON_OFO_POSITION                             0x4
#define _PWM1OFCON_OFO_SIZE                                 0x1
#define _PWM1OFCON_OFO_LENGTH                               0x1
#define _PWM1OFCON_OFO_MASK                                 0x10
#define _PWM1OFCON_OFM_POSN                                 0x5
#define _PWM1OFCON_OFM_POSITION                             0x5
#define _PWM1OFCON_OFM_SIZE                                 0x2
#define _PWM1OFCON_OFM_LENGTH                               0x2
#define _PWM1OFCON_OFM_MASK                                 0x60
#define _PWM1OFCON_PWM1OFS0_POSN                            0x0
#define _PWM1OFCON_PWM1OFS0_POSITION                        0x0
#define _PWM1OFCON_PWM1OFS0_SIZE                            0x1
#define _PWM1OFCON_PWM1OFS0_LENGTH                          0x1
#define _PWM1OFCON_PWM1OFS0_MASK                            0x1
#define _PWM1OFCON_PWM1OFS1_POSN                            0x1
#define _PWM1OFCON_PWM1OFS1_POSITION                        0x1
#define _PWM1OFCON_PWM1OFS1_SIZE                            0x1
#define _PWM1OFCON_PWM1OFS1_LENGTH                          0x1
#define _PWM1OFCON_PWM1OFS1_MASK                            0x2
#define _PWM1OFCON_PWM1OFM0_POSN                            0x5
#define _PWM1OFCON_PWM1OFM0_POSITION                        0x5
#define _PWM1OFCON_PWM1OFM0_SIZE                            0x1
#define _PWM1OFCON_PWM1OFM0_LENGTH                          0x1
#define _PWM1OFCON_PWM1OFM0_MASK                            0x20
#define _PWM1OFCON_PWM1OFM1_POSN                            0x6
#define _PWM1OFCON_PWM1OFM1_POSITION                        0x6
#define _PWM1OFCON_PWM1OFM1_SIZE                            0x1
#define _PWM1OFCON_PWM1OFM1_LENGTH                          0x1
#define _PWM1OFCON_PWM1OFM1_MASK                            0x40
#define _PWM1OFCON_PWM1OFS_POSN                             0x0
#define _PWM1OFCON_PWM1OFS_POSITION                         0x0
#define _PWM1OFCON_PWM1OFS_SIZE                             0x2
#define _PWM1OFCON_PWM1OFS_LENGTH                           0x2
#define _PWM1OFCON_PWM1OFS_MASK                             0x3
#define _PWM1OFCON_PWM1OFMC_POSN                            0x4
#define _PWM1OFCON_PWM1OFMC_POSITION                        0x4
#define _PWM1OFCON_PWM1OFMC_SIZE                            0x1
#define _PWM1OFCON_PWM1OFMC_LENGTH                          0x1
#define _PWM1OFCON_PWM1OFMC_MASK                            0x10
#define _PWM1OFCON_PWM1OFM_POSN                             0x5
#define _PWM1OFCON_PWM1OFM_POSITION                         0x5
#define _PWM1OFCON_PWM1OFM_SIZE                             0x2
#define _PWM1OFCON_PWM1OFM_LENGTH                           0x2
#define _PWM1OFCON_PWM1OFM_MASK                             0x60
#define _PWM1OFCON_OFS0_POSN                                0x0
#define _PWM1OFCON_OFS0_POSITION                            0x0
#define _PWM1OFCON_OFS0_SIZE                                0x1
#define _PWM1OFCON_OFS0_LENGTH                              0x1
#define _PWM1OFCON_OFS0_MASK                                0x1
#define _PWM1OFCON_OFS1_POSN                                0x1
#define _PWM1OFCON_OFS1_POSITION                            0x1
#define _PWM1OFCON_OFS1_SIZE                                0x1
#define _PWM1OFCON_OFS1_LENGTH                              0x1
#define _PWM1OFCON_OFS1_MASK                                0x2
#define _PWM1OFCON_OFM0_POSN                                0x5
#define _PWM1OFCON_OFM0_POSITION                            0x5
#define _PWM1OFCON_OFM0_SIZE                                0x1
#define _PWM1OFCON_OFM0_LENGTH                              0x1
#define _PWM1OFCON_OFM0_MASK                                0x20
#define _PWM1OFCON_OFM1_POSN                                0x6
#define _PWM1OFCON_OFM1_POSITION                            0x6
#define _PWM1OFCON_OFM1_SIZE                                0x1
#define _PWM1OFCON_OFM1_LENGTH                              0x1
#define _PWM1OFCON_OFM1_MASK                                0x40

// Register: PWM2PH
#define PWM2PH PWM2PH
extern volatile unsigned short          PWM2PH              __at(0xDA1);
#ifndef _LIB_BUILD
asm("PWM2PH equ 0DA1h");
#endif

// Register: PWM2PHL
#define PWM2PHL PWM2PHL
extern volatile unsigned char           PWM2PHL             __at(0xDA1);
#ifndef _LIB_BUILD
asm("PWM2PHL equ 0DA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM2PHL0               :1;
        unsigned PWM2PHL1               :1;
        unsigned PWM2PHL2               :1;
        unsigned PWM2PHL3               :1;
        unsigned PWM2PHL4               :1;
        unsigned PWM2PHL5               :1;
        unsigned PWM2PHL6               :1;
        unsigned PWM2PHL7               :1;
    };
    struct {
        unsigned PWM2PHL                :8;
    };
} PWM2PHLbits_t;
extern volatile PWM2PHLbits_t PWM2PHLbits __at(0xDA1);
// bitfield macros
#define _PWM2PHL_PH_POSN                                    0x0
#define _PWM2PHL_PH_POSITION                                0x0
#define _PWM2PHL_PH_SIZE                                    0x8
#define _PWM2PHL_PH_LENGTH                                  0x8
#define _PWM2PHL_PH_MASK                                    0xFF
#define _PWM2PHL_PWM2PHL0_POSN                              0x0
#define _PWM2PHL_PWM2PHL0_POSITION                          0x0
#define _PWM2PHL_PWM2PHL0_SIZE                              0x1
#define _PWM2PHL_PWM2PHL0_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL0_MASK                              0x1
#define _PWM2PHL_PWM2PHL1_POSN                              0x1
#define _PWM2PHL_PWM2PHL1_POSITION                          0x1
#define _PWM2PHL_PWM2PHL1_SIZE                              0x1
#define _PWM2PHL_PWM2PHL1_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL1_MASK                              0x2
#define _PWM2PHL_PWM2PHL2_POSN                              0x2
#define _PWM2PHL_PWM2PHL2_POSITION                          0x2
#define _PWM2PHL_PWM2PHL2_SIZE                              0x1
#define _PWM2PHL_PWM2PHL2_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL2_MASK                              0x4
#define _PWM2PHL_PWM2PHL3_POSN                              0x3
#define _PWM2PHL_PWM2PHL3_POSITION                          0x3
#define _PWM2PHL_PWM2PHL3_SIZE                              0x1
#define _PWM2PHL_PWM2PHL3_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL3_MASK                              0x8
#define _PWM2PHL_PWM2PHL4_POSN                              0x4
#define _PWM2PHL_PWM2PHL4_POSITION                          0x4
#define _PWM2PHL_PWM2PHL4_SIZE                              0x1
#define _PWM2PHL_PWM2PHL4_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL4_MASK                              0x10
#define _PWM2PHL_PWM2PHL5_POSN                              0x5
#define _PWM2PHL_PWM2PHL5_POSITION                          0x5
#define _PWM2PHL_PWM2PHL5_SIZE                              0x1
#define _PWM2PHL_PWM2PHL5_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL5_MASK                              0x20
#define _PWM2PHL_PWM2PHL6_POSN                              0x6
#define _PWM2PHL_PWM2PHL6_POSITION                          0x6
#define _PWM2PHL_PWM2PHL6_SIZE                              0x1
#define _PWM2PHL_PWM2PHL6_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL6_MASK                              0x40
#define _PWM2PHL_PWM2PHL7_POSN                              0x7
#define _PWM2PHL_PWM2PHL7_POSITION                          0x7
#define _PWM2PHL_PWM2PHL7_SIZE                              0x1
#define _PWM2PHL_PWM2PHL7_LENGTH                            0x1
#define _PWM2PHL_PWM2PHL7_MASK                              0x80
#define _PWM2PHL_PWM2PHL_POSN                               0x0
#define _PWM2PHL_PWM2PHL_POSITION                           0x0
#define _PWM2PHL_PWM2PHL_SIZE                               0x8
#define _PWM2PHL_PWM2PHL_LENGTH                             0x8
#define _PWM2PHL_PWM2PHL_MASK                               0xFF

// Register: PWM2PHH
#define PWM2PHH PWM2PHH
extern volatile unsigned char           PWM2PHH             __at(0xDA2);
#ifndef _LIB_BUILD
asm("PWM2PHH equ 0DA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM2PHH0               :1;
        unsigned PWM2PHH1               :1;
        unsigned PWM2PHH2               :1;
        unsigned PWM2PHH3               :1;
        unsigned PWM2PHH4               :1;
        unsigned PWM2PHH5               :1;
        unsigned PWM2PHH6               :1;
        unsigned PWM2PHH7               :1;
    };
    struct {
        unsigned PWM2PHH                :8;
    };
} PWM2PHHbits_t;
extern volatile PWM2PHHbits_t PWM2PHHbits __at(0xDA2);
// bitfield macros
#define _PWM2PHH_PH_POSN                                    0x0
#define _PWM2PHH_PH_POSITION                                0x0
#define _PWM2PHH_PH_SIZE                                    0x8
#define _PWM2PHH_PH_LENGTH                                  0x8
#define _PWM2PHH_PH_MASK                                    0xFF
#define _PWM2PHH_PWM2PHH0_POSN                              0x0
#define _PWM2PHH_PWM2PHH0_POSITION                          0x0
#define _PWM2PHH_PWM2PHH0_SIZE                              0x1
#define _PWM2PHH_PWM2PHH0_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH0_MASK                              0x1
#define _PWM2PHH_PWM2PHH1_POSN                              0x1
#define _PWM2PHH_PWM2PHH1_POSITION                          0x1
#define _PWM2PHH_PWM2PHH1_SIZE                              0x1
#define _PWM2PHH_PWM2PHH1_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH1_MASK                              0x2
#define _PWM2PHH_PWM2PHH2_POSN                              0x2
#define _PWM2PHH_PWM2PHH2_POSITION                          0x2
#define _PWM2PHH_PWM2PHH2_SIZE                              0x1
#define _PWM2PHH_PWM2PHH2_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH2_MASK                              0x4
#define _PWM2PHH_PWM2PHH3_POSN                              0x3
#define _PWM2PHH_PWM2PHH3_POSITION                          0x3
#define _PWM2PHH_PWM2PHH3_SIZE                              0x1
#define _PWM2PHH_PWM2PHH3_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH3_MASK                              0x8
#define _PWM2PHH_PWM2PHH4_POSN                              0x4
#define _PWM2PHH_PWM2PHH4_POSITION                          0x4
#define _PWM2PHH_PWM2PHH4_SIZE                              0x1
#define _PWM2PHH_PWM2PHH4_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH4_MASK                              0x10
#define _PWM2PHH_PWM2PHH5_POSN                              0x5
#define _PWM2PHH_PWM2PHH5_POSITION                          0x5
#define _PWM2PHH_PWM2PHH5_SIZE                              0x1
#define _PWM2PHH_PWM2PHH5_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH5_MASK                              0x20
#define _PWM2PHH_PWM2PHH6_POSN                              0x6
#define _PWM2PHH_PWM2PHH6_POSITION                          0x6
#define _PWM2PHH_PWM2PHH6_SIZE                              0x1
#define _PWM2PHH_PWM2PHH6_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH6_MASK                              0x40
#define _PWM2PHH_PWM2PHH7_POSN                              0x7
#define _PWM2PHH_PWM2PHH7_POSITION                          0x7
#define _PWM2PHH_PWM2PHH7_SIZE                              0x1
#define _PWM2PHH_PWM2PHH7_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH7_MASK                              0x80
#define _PWM2PHH_PWM2PHH_POSN                               0x0
#define _PWM2PHH_PWM2PHH_POSITION                           0x0
#define _PWM2PHH_PWM2PHH_SIZE                               0x8
#define _PWM2PHH_PWM2PHH_LENGTH                             0x8
#define _PWM2PHH_PWM2PHH_MASK                               0xFF

// Register: PWM2DC
#define PWM2DC PWM2DC
extern volatile unsigned short          PWM2DC              __at(0xDA3);
#ifndef _LIB_BUILD
asm("PWM2DC equ 0DA3h");
#endif

// Register: PWM2DCL
#define PWM2DCL PWM2DCL
extern volatile unsigned char           PWM2DCL             __at(0xDA3);
#ifndef _LIB_BUILD
asm("PWM2DCL equ 0DA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM2DCL0               :1;
        unsigned PWM2DCL1               :1;
        unsigned PWM2DCL2               :1;
        unsigned PWM2DCL3               :1;
        unsigned PWM2DCL4               :1;
        unsigned PWM2DCL5               :1;
        unsigned PWM2DCL6               :1;
        unsigned PWM2DCL7               :1;
    };
    struct {
        unsigned PWM2DCL                :8;
    };
} PWM2DCLbits_t;
extern volatile PWM2DCLbits_t PWM2DCLbits __at(0xDA3);
// bitfield macros
#define _PWM2DCL_DC_POSN                                    0x0
#define _PWM2DCL_DC_POSITION                                0x0
#define _PWM2DCL_DC_SIZE                                    0x8
#define _PWM2DCL_DC_LENGTH                                  0x8
#define _PWM2DCL_DC_MASK                                    0xFF
#define _PWM2DCL_PWM2DCL0_POSN                              0x0
#define _PWM2DCL_PWM2DCL0_POSITION                          0x0
#define _PWM2DCL_PWM2DCL0_SIZE                              0x1
#define _PWM2DCL_PWM2DCL0_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL0_MASK                              0x1
#define _PWM2DCL_PWM2DCL1_POSN                              0x1
#define _PWM2DCL_PWM2DCL1_POSITION                          0x1
#define _PWM2DCL_PWM2DCL1_SIZE                              0x1
#define _PWM2DCL_PWM2DCL1_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL1_MASK                              0x2
#define _PWM2DCL_PWM2DCL2_POSN                              0x2
#define _PWM2DCL_PWM2DCL2_POSITION                          0x2
#define _PWM2DCL_PWM2DCL2_SIZE                              0x1
#define _PWM2DCL_PWM2DCL2_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL2_MASK                              0x4
#define _PWM2DCL_PWM2DCL3_POSN                              0x3
#define _PWM2DCL_PWM2DCL3_POSITION                          0x3
#define _PWM2DCL_PWM2DCL3_SIZE                              0x1
#define _PWM2DCL_PWM2DCL3_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL3_MASK                              0x8
#define _PWM2DCL_PWM2DCL4_POSN                              0x4
#define _PWM2DCL_PWM2DCL4_POSITION                          0x4
#define _PWM2DCL_PWM2DCL4_SIZE                              0x1
#define _PWM2DCL_PWM2DCL4_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL4_MASK                              0x10
#define _PWM2DCL_PWM2DCL5_POSN                              0x5
#define _PWM2DCL_PWM2DCL5_POSITION                          0x5
#define _PWM2DCL_PWM2DCL5_SIZE                              0x1
#define _PWM2DCL_PWM2DCL5_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL5_MASK                              0x20
#define _PWM2DCL_PWM2DCL6_POSN                              0x6
#define _PWM2DCL_PWM2DCL6_POSITION                          0x6
#define _PWM2DCL_PWM2DCL6_SIZE                              0x1
#define _PWM2DCL_PWM2DCL6_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL6_MASK                              0x40
#define _PWM2DCL_PWM2DCL7_POSN                              0x7
#define _PWM2DCL_PWM2DCL7_POSITION                          0x7
#define _PWM2DCL_PWM2DCL7_SIZE                              0x1
#define _PWM2DCL_PWM2DCL7_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL7_MASK                              0x80
#define _PWM2DCL_PWM2DCL_POSN                               0x0
#define _PWM2DCL_PWM2DCL_POSITION                           0x0
#define _PWM2DCL_PWM2DCL_SIZE                               0x8
#define _PWM2DCL_PWM2DCL_LENGTH                             0x8
#define _PWM2DCL_PWM2DCL_MASK                               0xFF

